HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_bf.h
/** \\brief  Offset for Ifx_XBAR_ARBITER0_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER0_DBMADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER1_DBADD_Bits.ADDRESS_27 */
#define IFX_XBAR_ARBITER1_DBADD_ADDRESS_27_LEN (2)

/** \\brief  Mask for Ifx_XBAR_ARBITER1_DBADD_Bits.ADDRESS_27 */
#define IFX_XBAR_ARBITER1_DBADD_ADDRESS_27_MSK (0x3)

/** \\brief  Offset for Ifx_XBAR_ARBITER1_DBADD_Bits.ADDRESS_27 */
#define IFX_XBAR_ARBITER1_DBADD_ADDRESS_27_OFF (27)

/** \\brief  Length for Ifx_XBAR_ARBITER1_DBMADD_Bits.ADDRESS_27 */
#define IFX_XBAR_ARBITER1_DBMADD_ADDRESS_27_LEN (2)

/** \\brief  Mask for Ifx_XBAR_ARBITER1_DBMADD_Bits.ADDRESS_27 */
#define IFX_XBAR_ARBITER1_DBMADD_ADDRESS_27_MSK (0x3)

/** \\brief  Offset for Ifx_XBAR_ARBITER1_DBMADD_Bits.ADDRESS_27 */
#define IFX_XBAR_ARBITER1_DBMADD_ADDRESS_27_OFF (27)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS_2_LEN (18)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS_2_MSK (0x3ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER2_DBADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS_2_LEN (18)

/** \\brief  Mask for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS_2_MSK (0x3ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER2_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER2_DBMADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER3_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER3_DBADD_ADDRESS_2_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER3_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER3_DBADD_ADDRESS_2_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER3_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER3_DBADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER3_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER3_DBMADD_ADDRESS_2_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER3_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER3_DBMADD_ADDRESS_2_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER3_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER3_DBMADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_2_LEN (18)

/** \\brief  Mask for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_2_MSK (0x3ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER4_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER4_DBADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_2_LEN (18)

/** \\brief  Mask for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_2_MSK (0x3ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER4_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER4_DBMADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER5_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER5_DBADD_ADDRESS_2_LEN (25)

/** \\brief  Mask for Ifx_XBAR_ARBITER5_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER5_DBADD_ADDRESS_2_MSK (0x1ffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER5_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER5_DBADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER5_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER5_DBMADD_ADDRESS_2_LEN (25)

/** \\brief  Mask for Ifx_XBAR_ARBITER5_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER5_DBMADD_ADDRESS_2_MSK (0x1ffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER5_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER5_DBMADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS_2_LEN (29)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS_2_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER6_DBADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS_2_LEN (29)

/** \\brief  Mask for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS_2_MSK (0x1fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER6_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER6_DBMADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS_28 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS_28_LEN (3)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS_28 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS_28_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS_28 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS_28_OFF (28)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS_2_LEN (25)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS_2_MSK (0x1ffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER7_DBADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS_28 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_28_LEN (3)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS_28 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_28_MSK (0x7)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS_28 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_28_OFF (28)

/** \\brief  Length for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_2_LEN (25)

/** \\brief  Mask for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_2_MSK (0x1ffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER7_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER7_DBMADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS_29_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS_29_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS_29_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS_2_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS_2_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER8_DBADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_29_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_29_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_29_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_2_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_2_MSK (0x7ffff)

