HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_bf.h
/** \\brief  Offset for Ifx_XBAR_ARBITER8_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER8_DBMADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_29_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_29_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_29_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_2_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_2_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER9_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER9_DBADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_29_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_29_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS_29 */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_29_OFF (29)

/** \\brief  Length for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_2_LEN (19)

/** \\brief  Mask for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_2_MSK (0x7ffff)

/** \\brief  Offset for Ifx_XBAR_ARBITER9_DBMADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITER9_DBMADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITERD_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITERD_DBADD_ADDRESS_2_LEN (30)

/** \\brief  Mask for Ifx_XBAR_ARBITERD_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITERD_DBADD_ADDRESS_2_MSK (0x3fffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITERD_DBADD_Bits.ADDRESS_2 */
#define IFX_XBAR_ARBITERD_DBADD_ADDRESS_2_OFF (2)

/** \\brief  Length for Ifx_XBAR_ARBITERD_DBMADD_Bits.ADDRESS_0 */
#define IFX_XBAR_ARBITERD_DBMADD_ADDRESS_0_LEN (32)

/** \\brief  Mask for Ifx_XBAR_ARBITERD_DBMADD_Bits.ADDRESS_0 */
#define IFX_XBAR_ARBITERD_DBMADD_ADDRESS_0_MSK (0xffffffff)

/** \\brief  Offset for Ifx_XBAR_ARBITERD_DBMADD_Bits.ADDRESS_0 */
#define IFX_XBAR_ARBITERD_DBMADD_ADDRESS_0_OFF (0)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.ADDEN */
#define IFX_XBAR_DBCON_ADDEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.ADDEN */
#define IFX_XBAR_DBCON_ADDEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.ADDEN */
#define IFX_XBAR_DBCON_ADDEN_OFF (19)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.DBEN */
#define IFX_XBAR_DBCON_DBEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.DBEN */
#define IFX_XBAR_DBCON_DBEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.DBEN */
#define IFX_XBAR_DBCON_DBEN_OFF (0)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.DBSAT */
#define IFX_XBAR_DBCON_DBSAT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.DBSAT */
#define IFX_XBAR_DBCON_DBSAT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.DBSAT */
#define IFX_XBAR_DBCON_DBSAT_OFF (1)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.ERREN */
#define IFX_XBAR_DBCON_ERREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.ERREN */
#define IFX_XBAR_DBCON_ERREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.ERREN */
#define IFX_XBAR_DBCON_ERREN_OFF (20)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.MASEN */
#define IFX_XBAR_DBCON_MASEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.MASEN */
#define IFX_XBAR_DBCON_MASEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.MASEN */
#define IFX_XBAR_DBCON_MASEN_OFF (23)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.MASTER */
#define IFX_XBAR_DBCON_MASTER_LEN (6)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.MASTER */
#define IFX_XBAR_DBCON_MASTER_MSK (0x3f)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.MASTER */
#define IFX_XBAR_DBCON_MASTER_OFF (24)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.RDEN */
#define IFX_XBAR_DBCON_RDEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.RDEN */
#define IFX_XBAR_DBCON_RDEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.RDEN */
#define IFX_XBAR_DBCON_RDEN_OFF (16)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.REARM */
#define IFX_XBAR_DBCON_REARM_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.REARM */
#define IFX_XBAR_DBCON_REARM_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.REARM */
#define IFX_XBAR_DBCON_REARM_OFF (2)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.SETDBEVT */
#define IFX_XBAR_DBCON_SETDBEVT_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.SETDBEVT */
#define IFX_XBAR_DBCON_SETDBEVT_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.SETDBEVT */
#define IFX_XBAR_DBCON_SETDBEVT_OFF (3)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.SVMEN */
#define IFX_XBAR_DBCON_SVMEN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.SVMEN */
#define IFX_XBAR_DBCON_SVMEN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.SVMEN */
#define IFX_XBAR_DBCON_SVMEN_OFF (18)

/** \\brief  Length for Ifx_XBAR_DBCON_Bits.WREN */
#define IFX_XBAR_DBCON_WREN_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBCON_Bits.WREN */
#define IFX_XBAR_DBCON_WREN_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBCON_Bits.WREN */
#define IFX_XBAR_DBCON_WREN_OFF (17)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI0 */
#define IFX_XBAR_DBSAT_SCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI0 */
#define IFX_XBAR_DBSAT_SCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI0 */
#define IFX_XBAR_DBSAT_SCI0_OFF (0)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI1 */
#define IFX_XBAR_DBSAT_SCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI1 */
#define IFX_XBAR_DBSAT_SCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI1 */
#define IFX_XBAR_DBSAT_SCI1_OFF (1)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI2 */
#define IFX_XBAR_DBSAT_SCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI2 */
#define IFX_XBAR_DBSAT_SCI2_MSK (0x1)

