HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_bf.h
/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI2 */
#define IFX_XBAR_DBSAT_SCI2_OFF (2)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI3 */
#define IFX_XBAR_DBSAT_SCI3_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI3 */
#define IFX_XBAR_DBSAT_SCI3_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI3 */
#define IFX_XBAR_DBSAT_SCI3_OFF (3)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI4 */
#define IFX_XBAR_DBSAT_SCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI4 */
#define IFX_XBAR_DBSAT_SCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI4 */
#define IFX_XBAR_DBSAT_SCI4_OFF (4)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI5 */
#define IFX_XBAR_DBSAT_SCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI5 */
#define IFX_XBAR_DBSAT_SCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI5 */
#define IFX_XBAR_DBSAT_SCI5_OFF (5)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI6 */
#define IFX_XBAR_DBSAT_SCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI6 */
#define IFX_XBAR_DBSAT_SCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI6 */
#define IFX_XBAR_DBSAT_SCI6_OFF (6)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI7 */
#define IFX_XBAR_DBSAT_SCI7_OFF (7)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI8 */
#define IFX_XBAR_DBSAT_SCI8_OFF (8)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCI9 */
#define IFX_XBAR_DBSAT_SCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCI9 */
#define IFX_XBAR_DBSAT_SCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCI9 */
#define IFX_XBAR_DBSAT_SCI9_OFF (9)

/** \\brief  Length for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_DBSAT_Bits.SCID */
#define IFX_XBAR_DBSAT_SCID_OFF (15)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.ADDR_ECC */
#define IFX_XBAR_ERR_ADDR_ECC_OFF (16)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.MCI_SBS */
#define IFX_XBAR_ERR_MCI_SBS_OFF (24)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_LEN (4)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_MSK (0xf)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.OPC */
#define IFX_XBAR_ERR_OPC_OFF (4)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.RD */
#define IFX_XBAR_ERR_RD_OFF (0)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.SVM */
#define IFX_XBAR_ERR_SVM_OFF (2)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.TR_ID */
#define IFX_XBAR_ERR_TR_ID_OFF (8)

/** \\brief  Length for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_LEN (1)

/** \\brief  Mask for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_ERR_Bits.WR */
#define IFX_XBAR_ERR_WR_OFF (1)

/** \\brief  Length for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_LEN (32)

/** \\brief  Mask for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_MSK (0xffffffff)

/** \\brief  Offset for Ifx_XBAR_ERRADDR_Bits.ADDR */
#define IFX_XBAR_ERRADDR_ADDR_OFF (0)

/** \\brief  Length for Ifx_XBAR_EXTCON5_Bits.FREQDISF */
#define IFX_XBAR_EXTCON5_FREQDISF_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCON5_Bits.FREQDISF */
#define IFX_XBAR_EXTCON5_FREQDISF_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCON5_Bits.FREQDISF */
#define IFX_XBAR_EXTCON5_FREQDISF_OFF (6)

/** \\brief  Length for Ifx_XBAR_EXTCON5_Bits.FREQDISS */
#define IFX_XBAR_EXTCON5_FREQDISS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCON5_Bits.FREQDISS */
#define IFX_XBAR_EXTCON5_FREQDISS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCON5_Bits.FREQDISS */
#define IFX_XBAR_EXTCON5_FREQDISS_OFF (4)

/** \\brief  Length for Ifx_XBAR_EXTCON5_Bits.MAX_WS */
#define IFX_XBAR_EXTCON5_MAX_WS_LEN (4)

/** \\brief  Mask for Ifx_XBAR_EXTCON5_Bits.MAX_WS */
#define IFX_XBAR_EXTCON5_MAX_WS_MSK (0xf)

/** \\brief  Offset for Ifx_XBAR_EXTCON5_Bits.MAX_WS */
#define IFX_XBAR_EXTCON5_MAX_WS_OFF (12)

/** \\brief  Length for Ifx_XBAR_EXTCON5_Bits.NODELTR */
#define IFX_XBAR_EXTCON5_NODELTR_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCON5_Bits.NODELTR */
#define IFX_XBAR_EXTCON5_NODELTR_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCON5_Bits.NODELTR */
#define IFX_XBAR_EXTCON5_NODELTR_OFF (9)

/** \\brief  Length for Ifx_XBAR_EXTCON5_Bits.NOPDIS */
#define IFX_XBAR_EXTCON5_NOPDIS_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCON5_Bits.NOPDIS */
#define IFX_XBAR_EXTCON5_NOPDIS_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCON5_Bits.NOPDIS */
#define IFX_XBAR_EXTCON5_NOPDIS_OFF (24)

/** \\brief  Length for Ifx_XBAR_EXTCON5_Bits.NORMW */
#define IFX_XBAR_EXTCON5_NORMW_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCON5_Bits.NORMW */
#define IFX_XBAR_EXTCON5_NORMW_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCON5_Bits.NORMW */
#define IFX_XBAR_EXTCON5_NORMW_OFF (10)

/** \\brief  Length for Ifx_XBAR_EXTCON5_Bits.RETRY_CNT */
#define IFX_XBAR_EXTCON5_RETRY_CNT_LEN (4)

