HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_bf.h
/** \\brief  Mask for Ifx_XBAR_EXTCON5_Bits.RETRY_CNT */
#define IFX_XBAR_EXTCON5_RETRY_CNT_MSK (0xf)

/** \\brief  Offset for Ifx_XBAR_EXTCON5_Bits.RETRY_CNT */
#define IFX_XBAR_EXTCON5_RETRY_CNT_OFF (20)

/** \\brief  Length for Ifx_XBAR_EXTCON5_Bits.WFWD */
#define IFX_XBAR_EXTCON5_WFWD_LEN (1)

/** \\brief  Mask for Ifx_XBAR_EXTCON5_Bits.WFWD */
#define IFX_XBAR_EXTCON5_WFWD_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_EXTCON5_Bits.WFWD */
#define IFX_XBAR_EXTCON5_WFWD_OFF (3)

/** \\brief  Length for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_XBAR_ID_Bits.MODNUMBER */
#define IFX_XBAR_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_XBAR_ID_Bits.MODREV */
#define IFX_XBAR_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ID_Bits.MODREV */
#define IFX_XBAR_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ID_Bits.MODREV */
#define IFX_XBAR_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_XBAR_ID_Bits.MODTYPE */
#define IFX_XBAR_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_XBAR_ID_Bits.MODTYPE */
#define IFX_XBAR_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_XBAR_ID_Bits.MODTYPE */
#define IFX_XBAR_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI0 */
#define IFX_XBAR_IDINTEN_ENMCI0_OFF (16)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI10 */
#define IFX_XBAR_IDINTEN_ENMCI10_OFF (26)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI11 */
#define IFX_XBAR_IDINTEN_ENMCI11_OFF (27)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI12 */
#define IFX_XBAR_IDINTEN_ENMCI12_OFF (28)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI3 */
#define IFX_XBAR_IDINTEN_ENMCI3_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI3 */
#define IFX_XBAR_IDINTEN_ENMCI3_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI3 */
#define IFX_XBAR_IDINTEN_ENMCI3_OFF (19)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI4 */
#define IFX_XBAR_IDINTEN_ENMCI4_OFF (20)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI5 */
#define IFX_XBAR_IDINTEN_ENMCI5_OFF (21)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI6 */
#define IFX_XBAR_IDINTEN_ENMCI6_OFF (22)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI7 */
#define IFX_XBAR_IDINTEN_ENMCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI7 */
#define IFX_XBAR_IDINTEN_ENMCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI7 */
#define IFX_XBAR_IDINTEN_ENMCI7_OFF (23)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI8 */
#define IFX_XBAR_IDINTEN_ENMCI8_OFF (24)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENMCI9 */
#define IFX_XBAR_IDINTEN_ENMCI9_OFF (25)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI0 */
#define IFX_XBAR_IDINTEN_ENSCI0_OFF (0)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI1 */
#define IFX_XBAR_IDINTEN_ENSCI1_OFF (1)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI2 */
#define IFX_XBAR_IDINTEN_ENSCI2_OFF (2)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI3 */
#define IFX_XBAR_IDINTEN_ENSCI3_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI3 */
#define IFX_XBAR_IDINTEN_ENSCI3_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI3 */
#define IFX_XBAR_IDINTEN_ENSCI3_OFF (3)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTEN_Bits.ENSCI4 */
#define IFX_XBAR_IDINTEN_ENSCI4_OFF (4)

/** \\brief  Length for Ifx_XBAR_IDINTEN_Bits.ENSCI5 */
#define IFX_XBAR_IDINTEN_ENSCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTEN_Bits.ENSCI5 */
#define IFX_XBAR_IDINTEN_ENSCI5_MSK (0x1)

