HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxXbar_bf.h
/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI4 */
#define IFX_XBAR_IDINTSAT_IDSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI4 */
#define IFX_XBAR_IDINTSAT_IDSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI4 */
#define IFX_XBAR_IDINTSAT_IDSCI4_OFF (4)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI5 */
#define IFX_XBAR_IDINTSAT_IDSCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI5 */
#define IFX_XBAR_IDINTSAT_IDSCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI5 */
#define IFX_XBAR_IDINTSAT_IDSCI5_OFF (5)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI6 */
#define IFX_XBAR_IDINTSAT_IDSCI6_OFF (6)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI7 */
#define IFX_XBAR_IDINTSAT_IDSCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI7 */
#define IFX_XBAR_IDINTSAT_IDSCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI7 */
#define IFX_XBAR_IDINTSAT_IDSCI7_OFF (7)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI8 */
#define IFX_XBAR_IDINTSAT_IDSCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI8 */
#define IFX_XBAR_IDINTSAT_IDSCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI8 */
#define IFX_XBAR_IDINTSAT_IDSCI8_OFF (8)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCI9 */
#define IFX_XBAR_IDINTSAT_IDSCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCI9 */
#define IFX_XBAR_IDINTSAT_IDSCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCI9 */
#define IFX_XBAR_IDINTSAT_IDSCI9_OFF (9)

/** \\brief  Length for Ifx_XBAR_IDINTSAT_Bits.IDSCID */
#define IFX_XBAR_IDINTSAT_IDSCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_IDINTSAT_Bits.IDSCID */
#define IFX_XBAR_IDINTSAT_IDSCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_IDINTSAT_Bits.IDSCID */
#define IFX_XBAR_IDINTSAT_IDSCID_OFF (15)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI0 */
#define IFX_XBAR_INTSAT_PRSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI0 */
#define IFX_XBAR_INTSAT_PRSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI0 */
#define IFX_XBAR_INTSAT_PRSCI0_OFF (16)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI1 */
#define IFX_XBAR_INTSAT_PRSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI1 */
#define IFX_XBAR_INTSAT_PRSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI1 */
#define IFX_XBAR_INTSAT_PRSCI1_OFF (17)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI2 */
#define IFX_XBAR_INTSAT_PRSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI2 */
#define IFX_XBAR_INTSAT_PRSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI2 */
#define IFX_XBAR_INTSAT_PRSCI2_OFF (18)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI3 */
#define IFX_XBAR_INTSAT_PRSCI3_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI3 */
#define IFX_XBAR_INTSAT_PRSCI3_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI3 */
#define IFX_XBAR_INTSAT_PRSCI3_OFF (19)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI4 */
#define IFX_XBAR_INTSAT_PRSCI4_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI4 */
#define IFX_XBAR_INTSAT_PRSCI4_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI4 */
#define IFX_XBAR_INTSAT_PRSCI4_OFF (20)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI5 */
#define IFX_XBAR_INTSAT_PRSCI5_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI5 */
#define IFX_XBAR_INTSAT_PRSCI5_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI5 */
#define IFX_XBAR_INTSAT_PRSCI5_OFF (21)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI6 */
#define IFX_XBAR_INTSAT_PRSCI6_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI6 */
#define IFX_XBAR_INTSAT_PRSCI6_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI6 */
#define IFX_XBAR_INTSAT_PRSCI6_OFF (22)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI7 */
#define IFX_XBAR_INTSAT_PRSCI7_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI7 */
#define IFX_XBAR_INTSAT_PRSCI7_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI7 */
#define IFX_XBAR_INTSAT_PRSCI7_OFF (23)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI8 */
#define IFX_XBAR_INTSAT_PRSCI8_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI8 */
#define IFX_XBAR_INTSAT_PRSCI8_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI8 */
#define IFX_XBAR_INTSAT_PRSCI8_OFF (24)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCI9 */
#define IFX_XBAR_INTSAT_PRSCI9_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCI9 */
#define IFX_XBAR_INTSAT_PRSCI9_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCI9 */
#define IFX_XBAR_INTSAT_PRSCI9_OFF (25)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.PRSCID */
#define IFX_XBAR_INTSAT_PRSCID_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.PRSCID */
#define IFX_XBAR_INTSAT_PRSCID_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.PRSCID */
#define IFX_XBAR_INTSAT_PRSCID_OFF (31)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI0 */
#define IFX_XBAR_INTSAT_SCSCI0_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI0 */
#define IFX_XBAR_INTSAT_SCSCI0_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI0 */
#define IFX_XBAR_INTSAT_SCSCI0_OFF (0)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI1 */
#define IFX_XBAR_INTSAT_SCSCI1_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI1 */
#define IFX_XBAR_INTSAT_SCSCI1_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI1 */
#define IFX_XBAR_INTSAT_SCSCI1_OFF (1)

/** \\brief  Length for Ifx_XBAR_INTSAT_Bits.SCSCI2 */
#define IFX_XBAR_INTSAT_SCSCI2_LEN (1)

/** \\brief  Mask for Ifx_XBAR_INTSAT_Bits.SCSCI2 */
#define IFX_XBAR_INTSAT_SCSCI2_MSK (0x1)

/** \\brief  Offset for Ifx_XBAR_INTSAT_Bits.SCSCI2 */
#define IFX_XBAR_INTSAT_SCSCI2_OFF (2)

